import type { Locations } from '@widgets/SelectLocation/types'

export const locations: Locations = {
  Ульяновск: {
    'Пионерская улица, 15': '54.326748, 48.476111',
    'улица Гончарова, 36': '54.317858, 48.397526',
    'улица Ленина, 50А/116': '54.312275, 48.378788',
    'улица Аблукова, 33': '54.312070, 48.357084',
  },
  Курск: {
    'Красная площадь, 8': '51.730830, 36.191155',
    'улица Ленина, 20': '51.735259, 36.192674',
    'проспект Вячеслава Клыкова, 100': '51.714366, 36.137068',
    'улица Энергетиков, 2к2': '51.662384, 36.130178',
  },
}
