import type { Locations } from '../types'

export const locations: Locations = {
  Ульяновск: {
    center: [54.317858, 48.397526],
    zoom: 13,
    addresses: {
      'Пионерская улица, 15': [54.326748, 48.476111],
      'улица Гончарова, 36': [54.317858, 48.397526],
      'улица Ленина, 50А/116': [54.312275, 48.378788],
      'улица Аблукова, 33': [54.31207, 48.357084],
      'Минаева, 24': [54.307615, 48.393214],
      'улица Федерации, 57': [54.315941, 48.393694],
      'Московское шоссе, 108': [54.302814, 48.351273],
      'улица Карла Маркса, 13': [54.323421, 48.396521],
    },
  },

  Курск: {
    center: [51.73083, 36.191155],
    zoom: 13,
    addresses: {
      'Красная площадь, 8': [51.73083, 36.191155],
      'улица Ленина, 20': [51.735259, 36.192674],
      'проспект Вячеслава Клыкова, 100': [51.714366, 36.137068],
      'улица Энергетиков, 2к2': [51.662384, 36.130178],
      'улица Радищева, 86': [51.732814, 36.190126],
      'улица Карла Маркса, 68': [51.743521, 36.184327],
      'улица Дзержинского, 25': [51.728436, 36.179842],
      'улица Сумская, 37': [51.755214, 36.157483],
    },
  },

  Уфа: {
    center: [54.735147, 55.958727],
    zoom: 12,
    addresses: {
      'улица Ленина, 5': [54.719921, 55.945872],
      'улица Коммунистическая, 45': [54.723814, 55.947521],
      'проспект Октября, 31': [54.744382, 55.977214],
      'улица Революционная, 98': [54.725671, 55.963428],
      'улица Чернышевского, 82': [54.718436, 55.965214],
      'улица Менделеева, 137': [54.729842, 56.011527],
      'Российская улица, 94': [54.763214, 56.003841],
      'улица 50 лет СССР, 24': [54.774521, 56.006327],
    },
  },

  Казань: {
    center: [55.796127, 49.106414],
    zoom: 12,
    addresses: {
      'улица Баумана, 51': [55.788741, 49.122143],
      'улица Пушкина, 16': [55.788327, 49.130614],
      'улица Татарстан, 7': [55.781426, 49.115327],
      'проспект Победы, 50': [55.760814, 49.213527],
      'улица Чистопольская, 19': [55.820741, 49.147621],
      'улица Декабристов, 85': [55.827314, 49.079426],
      'улица Вишневского, 49': [55.783521, 49.150214],
      'проспект Ямашева, 97': [55.826841, 49.188327],
    },
  },

  Самара: {
    center: [53.195873, 50.100193],
    zoom: 12,
    addresses: {
      'улица Ленинградская, 29': [53.195421, 50.098327],
      'Московское шоссе, 17': [53.207814, 50.159421],
      'улица Куйбышева, 95': [53.187614, 50.088527],
      'улица Галактионовская, 106': [53.195827, 50.105214],
      'улица Ново-Садовая, 106': [53.208521, 50.135741],
      'улица Осипенко, 41': [53.212314, 50.116827],
      'улица Авроры, 63': [53.201426, 50.157314],
      'проспект Кирова, 147': [53.218741, 50.203527],
    },
  },
}
